#!/usr/bin/env python
# -*- coding: utf-8 -*-


"""
Определить значение функции Z=1/(XY) при произвольных X и Y.
Хацукова Аделаида
"""
if __name__ == '__main__':
    x = int(input("Введите x: "))
    y = int(input("Введите y: "))
    Z = 1 / (x * y)
    print(f"Значение функции Z равно: {Z}")